In [1]:
import pandas as pd

obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [3]:
obj.reindex(['a', 'b', 'c', 'd']) #重新排序索引

a   -5.3
b    7.2
c    3.6
d    4.5
dtype: float64

In [6]:
obj.reindex(['c', 'd']) #選取索引

c    3.6
d    4.5
dtype: float64

In [11]:
#dataFrame
import numpy as np

frame = pd.DataFrame(np.arange(9).reshape(3,3),
                    index=['a', 'b', 'c'],
                    columns=['台北','台中','高雄'])
frame

   台北  台中  高雄
a   0   1   2
b   3   4   5
c   6   7   8

In [14]:
frame.reindex(['a','c']) #選取需要的列

   台北  台中  高雄
a   0   1   2
c   6   7   8

In [16]:
frame.reindex(['a','c'],columns=['台北','台中'])

   台北  台中
a   0   1
c   6   7

In [18]:
#drop()
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj.drop('c')

d    4.5
b    7.2
a   -5.3
dtype: float64

In [21]:
obj.drop(['a', 'c'])

d    4.5
b    7.2
dtype: float64

In [24]:
frame = pd.DataFrame(np.arange(16).reshape(4,4),
                    index=['台北','台中','高雄','台南'],
                    columns=['one', 'two', 'three', 'four'])
frame

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
高雄    8    9     10    11
台南   12   13     14    15

In [26]:
frame.drop(index=['台北','台中'],columns=['one','two'])

    three  four
高雄     10    11
台南     14    15

In [27]:
frame

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
高雄    8    9     10    11
台南   12   13     14    15